"use client";

import { useState } from "react";
import { useParams } from "next/navigation";
import { products } from "@/data/products";
import { Swiper, SwiperSlide } from "swiper/react";
import { Navigation } from "swiper/modules";
import Image from "next/image";

import "swiper/css";
import "swiper/css/navigation";

// بيانات ولايات + أسعار التوصيل
// بيانات ولايات + أسعار التوصيل (عربي)
const wilayas = [
  { name: "أدرار", home: 1100, desk: 600 ,    communes: [
      "أدرار", "تامست", "زاوية كنتة", "فنوغيل", "تامنطيت", "أولف", "تسابيت",
      "أقبلي", "بودة", "شروين", "تيميمون", "طالمين", "قصر قدور", "رقان",
      "إن زغمير", "أولاد أحمد تيمي", "أولاد سعيد", "بسبسب", "تبلبالة",
      "أولاد عيسى", "برج باجي مختار", "تينركوك", "أولاد نخيل", "دلدول"
    ]},
  { name: "الشلف", home: 700, desk: 400,
        communes: [
      "الشلف", "أولاد فارس", "أم الذروع", "بني بوعتاب", "الكريمية", "حرشون",
      "أبو الحسن", "بريرة", "سيدي عبد الرحمان", "تنس", "بوزغاية", "الحجاج",
      "الظهرة", "تاوقريت", "بني راشد", "أولاد عباس", "الهرانفة", "بني حواء",
      "وادي قوسين", "سيدي عكاشة", "تاجنة", "المصدق", "سنجاس", "المرسى",
      "بوقادير", "وادي الفضة", "عين مران", "الولجة", "الحبيلة"
    ]

   },
   { name: "الأغواط", 
  home:500 , 
  desk: 900, 
  communes: [
    "الأغواط", "أفلو", "قصر الحيران", "تاجرونة", "عين ماضي", "وادي مرة",
    "سيدي بوزيد", "حاسي الرمل", "الحويطة", "سبقاق", "حاسي الدلاعة",
    "سيدي مخلوف", "بن ناصر بن شهرة", "بريدة", "العسافية", "الخنق",
    "تاويالة", "الحاج المشري", "الغيشة", "وادي مزي", "قلتة سيدي سعد",
    "عين سيدي علي", "البيضاء", "تاجموت", "العسالية", "أولاد سيدي إبراهيم"
  ]
},

  { name: "أم البواقي", home: 790, desk: 400 ,
     communes: [
      "أم البواقي", "عين البيضاء", "عين مليلة", "سيقوس", "الضلعة", "بريش",
      "عين كرشة", "سوق نعمان", "فكيرينة", "هنشير تومغني", "قصر الصبيحي",
      "الحرملية", "بئر الشهداء", "أولاد زواي", "أولاد حملة", "الجازية",
      "بئر الشهداء", "عين ببوش", "أولاد قاسم", "عين الديس", "وادي نيني"
    ]
  },
  { name: "باتنة", home: 790, desk: 400 
    ,   communes: [
      "باتنة", "عين ياقوت", "سريانة", "فسديس", "وادي الشعبة", "تازولت",
      "منعة", "آريس", "ثنية العابد", "تيغانمين", "مروانة", "حيدوسة",
      "وادي الماء", "عين جاسر", "القصبات", "بريكة", "الجزار", "تيمقاد",
      "لمسان", "زانة البيضاء", "قصر بلزمة", "عيون العصافير", "تغرغار", "إشمول",
      "بومقر", "أولاد سلام", "أولاد عمار", "عين التوتة", "بوزينة", "تيلاطو"
    ]
  },
  { name: "بجاية", home: 690, desk: 400,
     communes: [
    "بجاية", "أوقاس", "تيمزريت", "تيشي", "آيت رزين", "تالة حمزة",
    "أميزور", "بني جليل", "سيدي عياد", "برباشة", "أدكار", "آيت إسماعيل",
    "شميني", "مزبود", "توجة", "أمالو", "فرعون", "سوق الإثنين",
    "ملبو", "بوخليفة", "أقبو", "تازملت", "إغرام", "شميني",
    "إغيل علي", "أوزلاقن", "تينبدار", "آيت إسماعيل", "بني مليكش", "درقينة"
  ]
   },
  { name: "بسكرة", home: 900, desk: 500 ,
     communes: [
    "بسكرة", "أورلال", "الحاجب", "عين الناقة", "جمورة", "الحوش",
    "ليوة", "مشونش", "القنطرة", "الوطاية", "عين زعطوط", "زريبة الوادي",
    "بوشقرون", "برج بن عزوز", "لوة", "سيدي عقبة", "عين صالح", "مزيرعة",
    "الشعيبة", "أوماش", "الغروس", "الدوسن", "المزيرعة", "زريبة الوادي",
    "خنقة سيدي ناجي", "فرفار", "عين وسارة"
  ]
  },
  { name: "بشار", home: 1100, desk: 600 , communes: [
    "بشار", "لحمر", "مشرع هواري بومدين", "إقلي", "تاغيت", "العبادلة",
    "كرزاز", "بني ونيف", "لحمر", "القنادسة", "بوكايس", "تامترت",
    "بني عباس", "تامترت", "الواتة", "قصور", "بني يخلف", "تامترت"
  ]},
  { name: "البليدة", home: 500, desk: 250,communes: [
    "البليدة", "بوعرفة", "الشبلي", "بوعينان", "بوعرفة", "بوينان",
    "الصومعة", "العفرون", "مفتاح", "موزاية", "الشفة", "أولاد سلامة",
    "بوفاريك", "بوقرة", "بن خليل", "بني تامو", "العفرون", "وادي العلايق",
    "بني مراد", "بوفاريك", "بوينان", "الصومعة", "أولاد يعيش", "أولاد موسى"
  ]},
  { name: "البويرة", home: 650, desk: 400 ,  communes: [
    "البويرة", "عين بسام", "سور الغزلان", "برج أوخريص", "الهاشمية", "القادرية",
    "الحجرة الزرقاء", "الأخضرية", "أهل القصر", "آيت لعزيز", "معلة", "آيت غرمول",
    "روراوة", "أغبالو", "بودربالة", "الأخضرية", "أمشدالة", "الزبربر",
    "حسناوة", "شرفة", "بشلول", "الهاشمية", "بئر غبالو", "ديرة",
    "البويرة", "أهل القصر", "آيت قنون", "تاقدامت", "المعمورة"
  ]},
  { name: "تمنراست", home: 1400, desk: 800,  communes: [
    "تمنراست", "أبلسة", "عين صالح", "عين غار", "تازروك",
    "تين زاواتين", "إينغر", "فقارة الزوى", "إدلس", "عين قزام"
  ] },
  { name: "تبسة", home: 790, desk: 450,communes: [
    "تبسة", "العوينات", "المريج", "الونزة", "أم علي",
    "بجن", "بكارية", "بوخضرة", "بوخضرة", "بئر الذهب",
    "بئر العاتر", "الحويجبات", "الماء الأبيض", "المزرعة",
    "نقرين", "سطح قنطيس", "العقلة", "قريقر", "الكويف"
  ] },
  { name: "تلمسان", home: 790, desk: 400,  communes: [
    "تلمسان", "منصورة", "شتوان", "عين فزة", "هنين",
    "بني بوسعيد", "سبدو", "العريشة", "باب العسة", "مرسى بن مهيدي",
    "مغنية", "سبع شيوخ", "الحناية", "عين تالوت", "سيدي الجيلالي",
    "الغزوات", "ندرومة", "الفحول", "بني سنوس", "البويهي"
  ] },
  { name: "تيارت", home: 790, desk: 400 ,  communes: [
    "تيارت", "مدروسة", "عين الذهب", "زمالة الأمير عبد القادر", "مهدية",
    "فرندة", "دحموني", "سي عبد الغني", "عين كرمس", "عين الحديد",
    "تاخمارت", "قصر الشلالة", "رحوية", "السوقر", "وادي ليلي",
    "ملاكو", "عين بوشقيف", "بوقرة", "جبل عمور", "قرطوفة"
  ]},
  { name: "تيزي وزو", home: 630, desk: 350,  communes: [
    "تيزي وزو", "أزفون", "عين الحمام", "بني دوالة", "بني زمنزار",
    "بوزقان", "إيفرحونان", "إيلولة أمالو", "إبودرارن", "إعكورن",
    "ذراع بن خدة", "ذراع الميزان", "ماكودة", "واقنون", "معاتقة",
    "مشطراس", "واضية", "بني يني", "بوغني", "أقني قغران"
  ] },
  { name: "الجزائر", home: 380, desk: 200,  communes: [
    "الجزائر الوسطى", "باب الوادي", "القصبة", "المدنية", "الحامة",
    "بلوزداد", "بئر مراد رايس", "حيدرة", "المحمدية", "باش جراح",
    "بئر توتة", "الكاليتوس", "بوزريعة", "الرايس حميدو", "باب الزوار",
    "درارية", "بئر خادم", "برج الكيفان", "الحراش", "حسين داي",
    "القبة", "المرادية", "الأبيار", "الدار البيضاء", "زرالدة"
  ] },
  { name: "الجلفة", home: 890, desk: 500,  communes: [
    "الجلفة", "عين وسارة", "حد الصحاري", "الادريسية", "فيض البطمة",
    "مسعد", "دار الشيوخ", "بن يعقوب", "بنهار", "سيدي لعجال",
    "عين فقه", "حاسي بحبح", "زكار", "قدارة", "المليليحة",
    "أم العظام", "سيدي بايزيد", "القديد", "سلمانة", "عين الشهداء"
  ] },
  { name: "جيجل", home: 700, desk: 400,  communes: [
    "جيجل", "الطاهير", "الميلية", "العوانة", "زيامة منصورية",
    "القنار نشفي", "أولاد رابح", "الشقفة", "سيدي معروف", "جيملة",
    "بودريعة بني ياجيس", "الجمعة بني حبيبي", "بوراوي بلهادف", "إيراقن سويسي", "سلمى بن زيادة"
  ] },
  { name: "سطيف", home: 690, desk: 390, communes: [
    "سطيف", "عين أرنات", "عين ولمان", "عين أزال", "قجال",
    "بوقاعة", "بوطالب", "صالح باي", "أولاد صابر", "بئر العرش",
    "أوريسيا", "بابور", "بني عزيز", "عين الروى", "العلمة",
    "جميلة", "قنزات", "أيت نوال مزادة", "ماوكلان", "الحامة"
  ] },
  { name: "سعيدة", home: 790, desk: 390 ,  communes: [
    "سعيدة", "عين الحجر", "سيدي أحمد", "أولاد إبراهيم", "مولاي العربي",
    "عين السلطان", "الحساسنة", "يوب", "سيدي بوبكر", "سيدي أعمر",
    "دوي ثابت", "هونت", "تامسنة", "المعمورة", "ترسين"
  ]},
  { name: "سكيكدة", home: 690, desk: 390 , communes: [
    "سكيكدة", "عزابة", "الحروش", "بن عزوز", "عين بوزيان",
    "بكوش لخضر", "بني بشير", "أم الطوب", "السبت", "المناصرية",
    "الحدائق", "بوالسمط", "جندل سعدي محمد", "أولاد حبابة", "عين شرشار",
    "قنواع", "الزيتونة", "تمايز", "فلفلة", "الكركرة"
  ]},
  { name: "سيدي بلعباس", home: 690, desk: 390 ,  communes: [
    "سيدي بلعباس", "سيدي خالد", "مرحوم", "تسالة", "تلاغ",
    "رأس الماء", "لمطار", "عين البرد", "مسيد", "مولاي سليسن",
    "تنيرة", "بن باديس", "حاسي زهانة", "سفيزف", "عين أدن",
    "بوخنيفيس", "عين تندامين", "الضاية", "مزاورو", "تغليت"
  ]},
  { name: "عنابة", home: 700, desk: 390 ,  communes: [
    "عنابة", "الحجار", "برحال", "البوني", "عين الباردة",
    "سرايدي", "شطايبي", "واد العنب", "التريعات"
  ]},
  { name: "قالمة", home: 790, desk: 390,  communes: [
    "قالمة", "عين رقادة", "حمام دباغ", "حمام النبايل", "بوشقوف",
    "بوهمدان", "برج صباط", "بلخير", "بني مزلين", "هيليوبوليس",
    "عين بن بيضاء", "الفجوج", "بوحشانة", "وادي الشحم", "وادي زناتي",
    "بني صالح", "تاملوكة", "عين مخلوف", "قلعة بوصبع", "جبالة"
  ] },
  { name: "قسنطينة", home: 700, desk: 390 ,  communes: [
    "قسنطينة", "ابن باديس", "زيغود يوسف", "الخروب", "عين عبيد",
    "ابن زياد", "دائرة حامة بوزيان", "بني حميدان", "ديدوش مراد", "مسعود بوجريو"
  ]},
  { name: "المدية", home: 600, desk: 390 , communes: [
    "المدية", "وزرة", "تيزي غنيف", "العزيزية", "البرواقية",
    "أولاد عنتر", "تمزقيدة", "سغوان", "عين بوسيف", "شلالة العذاورة",
    "سيدي نعمان", "الحوضان", "أولاد إبراهيم", "أولاد معرف", "بوشراحيل",
    "مزغنة", "عين القصير", "أولاد امعرف", "أولاد بوعشرة", "العمارية"
  ]},
  { name: "مستغانم", home: 700, desk: 390,  communes: [
    "مستغانم", "عشعاشة", "خير الدين", "سيدي علي", "عين تادلس",
    "حاسي ماماش", "ماسرة", "بوقيراط", "حاسي مماش", "سيدي بلعطار",
    "سيدي لخضر", "عين بودينار", "أولاد بوغالم", "النكمارية", "عين نويسي",
    "سور", "صيادة", "عين سيدي شريف", "الصفصاف", "حجاج"
  ]
 },
  { name: "المسيلة", home: 790, desk: 490,  communes: [
    "المسيلة", "حمام الضلعة", "بوسعادة", "أولاد دراج", "أولاد عدي لقبالة",
    "جبل مساعد", "أولاد سيدي إبراهيم", "أولاد منصور", "المطارفة", "مقرة",
    "عين الخضراء", "برهوم", "عين الملح", "سيدي عيسى", "سيدي عامر",
    "المعاضيد", "تامسة", "بني يلمان", "المعاضيد", "المعاصم"
  ] },
  { name: "معسكر", home: 690, desk: 390 ,  communes: [
    "معسكر", "غريس", "سيق", "وادي الأبطال", "بوهني", 
    "تيغنيف", "الحشم", "البرج", "المامونية", "ماوسة",
    "سيدي بوسعيد", "سيدي قادة", "خلوية", "المنور", "عوف",
    "تيرني بني هديل", "القاطة", "المامونية", "فروحة", "سيدي عبد المؤمن"
  ]},
  { name: "ورقلة", home: 990, desk: 490,  communes: [
    "ورقلة", "الرويسات", "سيدي خويلد", "النقوسة", "عين البيضاء",
    "الحجيرة", "تماسين", "الطيبات", "البرمة", "حاسي مسعود",
    "سيدي سليمان", "ورقلة الجديدة", "سيدي أمبارك"
  ] },
  { name: "وهران", home: 690, desk: 390, communes: [
    "البيض", "الأبيض سيدي الشيخ", "بريزينة", "رقاصة", "بوقطب",
    "الكاف الأحمر", "سيدي عامر", "الأربعاء", "الخيثر", "المحبس",
    "سيدي طيفور", "الغاسول", "الحسينية", "الشقيق", "البنود",
    "توسمولين", "كراكدة", "أستيتن", "بريزينة", "المشرية"
  ] },
  { name: "البيض", home: 990, desk: 590,  communes: [
    "البيض", "الأبيض سيدي الشيخ", "بريزينة", "رقاصة", "بوقطب",
    "الكاف الأحمر", "سيدي عامر", "الأربعاء", "الخيثر", "المحبس",
    "سيدي طيفور", "الغاسول", "الحسينية", "الشقيق", "البنود",
    "توسمولين", "كراكدة", "أستيتن", "بريزينة", "المشرية"
  ] },
  { name: "إليزي", home: 1300, desk: 790,  communes: [
    "إليزي", "جانت", "دبداب", "برج عمر إدريس", "إن أميناس",
    "إين أميناس الجديدة", "تامزاوات"
  ] },
  { name: "برج بوعريريج", home: 700, desk: 390,  communes: [
    "برج بوعريريج", "الحمادية", "رأس الواد", "المهير", "جعافرة",
    "عين تاغروت", "عين تسرة", "عين تاقورايت", "غيلاسة", "بئر قاصد علي",
    "سيدي أمبارك", "العناصر", "تسامرت", "تسامرت الشرقية", "المنصورة",
    "برج زمورة", "القصور", "المهير", "الحوضين", "أولاد إبراهيم"
  ] },
  { name: "بومرداس", home: 590, desk: 350 ,  communes: [
    "بومرداس", "برج منايل", "الثنية", "يسر", "الناصرية",
    "تيمزريت", "تيجلابين", "قورصو", "بغلية", "الجزيرة",
    "أولاد موسى", "أولاد هداج", "سيدي داود", "بودواو", "حمادي",
    "خميس الخشنة", "بن شود", "الناصرية", "زموري", "لقاطة"
  ]},
  { name: "الطارف", home: 790, desk: 450 ,  communes: [
    "الطارف", "الذرعان", "البسباس", "بوقوس", "بوثلجة",
    "عين العسل", "بن مهيدي", "الشافية", "العيون", "حمام بني صالح",
    "الزيتونة", "عين الكرمة", "بحيرة الطيور", "شبيطة مختار", "بوحجار",
    "بريحان", "المحصر", "وادي الزيتون"
  ]},
  { name: "تندوف", home: 1250, desk: 690 ,  communes: [
    "تندوف", "أم العسل"
  ]},
  { name: "تيسمسيلت", home: 790, desk: 390,  communes: [
    "تيسمسيلت", "ثنية الأحد", "الأزهرية", "الأربعاء", "الأمير عبد القادر",
    "بني شعيب", "بوقايد", "برج بونعامة", "لرجام", "خميستي",
    "المعاصم", "العسالية", "أولاد بسام", "سيدي العنتري", "سيدي سليمان",
    "تملاحت", "العزايل", "ملعب"
  ] },
  { name: "الوادي", home: 900, desk: 490,  communes: [
    "الوادي", "البياضة", "قمار", "الحمراية", "الدبيلة",
    "الميعة", "الرقيبة", "المغير", "جامعة", "الطالب العربي",
    "العقلة", "المقرن", "سيدي عون", "التلاغمة", "دوار الماء",
    "المغير", "سيدي خليل", "ورماس", "أم الطيور", "العقلة"
  ] },
  { name: "خنشلة", home: 800, desk: 450,  communes: [
    "خنشلة", "عين الطويلة", "بابار", "الحامة", "طامزة",
    "ششار", "بغاي", "متوسة", "لمصارة", "انسيغة",
    "خيران", "بوجنيبة", "مصارة", "أولاد رشاش", "قايس"
  ] },
  { name: "سوق أهراس", home: 800, desk: 450 ,  communes: [
    "سوق أهراس", "سدراتة", "المراهنة", "تاورة", "عين الزانة",
    "الحدادة", "الزوابي", "الحنانشة", "بئر بوحوش", "العقلية",
    "أولاد إدريس", "المشروحة", "ولاد ميمون", "ترقالت", "المشيرية",
    "مداوروش", "أم العظائم", "أولاد ماضي"
  ]},
  { name: "تيبازة", home: 550, desk: 350,  communes: [
    "تيبازة", "القليعة", "بواسماعيل", "حجوط", "فوكة",
    "بوهارون", "شرشال", "سيدي غيلاس", "الداموس", "قوراية",
    "الناظور", "البرواڨية", "حجوط الجديدة", "أغبال", "الحطاطبة",
    "أحمر العين", "مراد", "عين تاقورايت", "سيدي راشد"
  ] },
  { name: "ميلة", home: 690, desk: 390 ,  communes: [
    "ميلة", "فرجيوة", "شلغوم العيد", "ترعي باينان", "بوحاتم",
    "تيبرقنت", "عين البيضاء أحريش", "الرواشد", "التلاغمة", "التسدان",
    "وادي النجاء", "عميرة آراس", "أولاد اخلوف", "وادي العثمانية", "الحمالة",
    "مينار زارزة", "سيدي خليفة", "عين مليلة", "تسالة لمطاعي"
  ]},
  { name: "عين الدفلى", home: 650, desk: 390 ,  communes: [
    "عين الدفلى", "خميس مليانة", "العطاف", "العبادية", "بومدفع",
    "العامرة", "جليدة", "الحسانية", "مليانة", "برج الأمير خالد",
    "بئر ولد خليفة", "وادي الجمعة", "الروينة", "سيدي الأخضر", "المخاطرية",
    "جمعة أولاد الشيخ", "حمام ريغة", "تيبركانين", "عريب"
  ]},
  { name: "النعامة", home: 990, desk: 550,  communes: [
    "النعامة", "المشرية", "عين الصفراء", "مغرار", "عسلة",
    "جنين بورزق", "مكمن بن عمار", "تيوت", "قصدير", "صفيصيفة"
  ] },
  { name: "عين تموشنت", home: 690, desk: 390 ,  communes: [
    "عين تموشنت", "بني صاف", "حمام بوحجر", "شعبة اللحم", "تامزوغة",
    "سيدي بن عدة", "سيدي الصافي", "العزايل", "ولهاصة الغرابة", "أولاد بوجمعة",
    "ولهاصة الشرقية", "الحساسنة", "تارقة", "عين الأربعاء", "ولهاصة الكبرى",
    "عين الكيحل", "عين الطلبة", "المالح", "بوزجار", "ولهاصة الصغرى"
  ]},
  { name: "غرداية", home: 990, desk: 490 ,  communes: [
    "غرداية", "بونورة", "العطف", "ضاية بن ضحوة", "زلفانة",
    "متليلي", "سبسب", "المنصورة", "القرارة", "بريان"
  ]},
  { name: "غليزان", home: 700, desk: 390,  communes: [
    "غليزان", "وادي ارهيو", "زمورة", "حمادنة", "الحمادنة الشرقية",
    "الماين", "الكريمية", "عين الرحمة", "القطنة", "واد السلام",
    "القلعة", "سيدي سعادة", "جديوية", "مزال", "سيدي لزرق",
    "الولجة", "حد الشكالة", "عين طارق", "الحدائق", "سيدي أمحمد بن علي"
  ] },
  // الولايات المستحدثة التي زوّدتني بها:
  { name: "تيميمون", home: 1300, desk: 650,   communes: [
    "تيميمون", "أولاد سعيد", "أولاد عيسى", "أقبلي", "تينركوك",
    "طالمين", "شروين", "دلدول"
  ] },
  { name: "أولاد جلال", home: 900, desk: 490 ,  communes: [
    "أولاد جلال", "الشعيبة", "الدوسن", "سيدي خالد", "بسبسب",
    "راس الميعاد", "البسباس"
  ]},
  { name: "بني عباس", home: 1100, desk: 590 ,  communes: [
    "بني عباس", "تامترت", "الكرط", "أولاد خضير", "أولاد خضير الغربية",
    "لحمر", "شروين"
  ]},
  { name: "عين صالح", home: 1300, desk: 890,  communes: [
    "عين صالح", "فقارة الزوى", "إينغر"
  ] },
  { name: "تقرت", home: 950, desk: 500 },
  { name: "المغير", home: 950, desk: 550, communes: [
    "المغير", "سيدي خليل", "جامعة", "سيدي عمران", "المرارة",
    "أم الطيور", "السطيل", "بني مهدي"
  ] },
  { name: "المنيعة", home: 950, desk: 550 ,  communes: [
    "المنيعة", "حاسي الفحل", "حاسي القارة"
  ]},
];
function getDeliveryPrice(wilayaName, deliveryType) {
  const selected = wilayas.find((w) => w.name === wilayaName);
  if (!selected) return 0;
  return deliveryType === "home" ? selected.home : selected.desk;
}
export default function ProductPage() {
  const { id } = useParams();
  const product = products.find((p) => p.id === parseInt(id));
  const [size, setSize] = useState("S");
  const [name, setName] = useState("");
  const [phone, setPhone] = useState("");
  const [wilaya, setWilaya] = useState(wilayas[0].name);
    const [commune, setCommune] = useState(wilayas[0].communes[0]);
      const [loading, setLoading] = useState(false);


  const [address, setAddress] = useState("");
  const [delivery, setDelivery] = useState("home");
  const [quantity, setQuantity] = useState(1);
  const [color, setColor] = useState(product.colors[0] ?? ""); // القيمة الافتراضية أول لون
    const deliveryPrice = getDeliveryPrice(wilaya, delivery);



  if (!product) {
    return (
      <div className="text-center py-10 text-black">❌ المنتج غير موجود</div>
    );
  }

  const selectedWilaya = wilayas.find((w) => w.name === wilaya);
  const total = product.price * quantity + deliveryPrice;

  const handleOrder = async () => {
    if (!name || !phone || !address || !size || !wilaya || !delivery) {
      alert("⚠️ يرجى ملء جميع الحقول المطلوبة");
      return;
    }
    

    const orderData = {
      name,
      phone,
      wilaya,
      commune,
      address,
      size,
      color,
      quantity,
      delivery,
      productId: product.id,
      productName:product.name,
      //status:["pending","confirmed"],
      total,
    };
        setLoading(true);
    try {
      await fetch("/api/orders", {
        method: "POST",
        headers: { "Content-Type": "application/json" },
        body: JSON.stringify(orderData),
      });
      alert("✅ تم إرسال الطلب بنجاح!");
    } catch (err) {
      alert("❌ حدث خطأ أثناء الإرسال");
    } finally {
      setLoading(false);
    }


    await fetch("/api/orders", {
      method: "POST",
      headers: { "Content-Type": "application/json" },
      body: JSON.stringify(orderData),
    });

    alert("✅ تم إرسال الطلب بنجاح!");
  };

  return (
    <div className="p-6 max-w-3xl mx-auto text-black">
      {/* سلايدر الصور */}
      <Swiper navigation modules={[Navigation]} className="mb-6">
        {(product.images ?? [product.image]).map((img, i) => (
          <SwiperSlide key={i}>
            <img
              src={img}
              alt={product.name}
              className="w-full h-64 object-cover rounded-lg"
            />
          </SwiperSlide>
        ))}
      </Swiper>

      {/* اسم المنتج */}
      <h1 className="text-2xl font-bold text-blue-600 mb-2">{product.name}</h1>

      {/* السعر */}
      <p className="text-lg font-semibold mb-4">{product.price} دج</p>

      {/* اختيار المقاس */}
      <div className="mb-4">
        <label className="font-semibold">المقاس:</label>
        <select
          required
          value={size}
          onChange={(e) => setSize(e.target.value)}
          className="border rounded p-2 w-full"
        >
          <option value="S">صغير (S)</option>
          <option value="L">كبير (L)</option>
          <option value="XL">كبير جدا (XL)</option>
        </select>
      </div>
      <div className="mb-4">
        <label className="font-semibold block mb-1">اللون:</label>
        <select
          required
          value={color}
          onChange={(e) => setColor(e.target.value)}
          className="border rounded p-2 w-full"
        >
          {product.colors.map((c) => (
            <option key={c} value={c}>
              {c === "black"
                ? "أسود"
                : c === "white"
                ? "أبيض"
                : c === "gray"
                ? "رمادي"
                : c}
            </option>
          ))}
        </select>
      </div>

      {/* الاستمارة */}
      <div className="space-y-4">
        <input
          required
          type="text"
          placeholder="الإسم الكامل"
          value={name}
          onChange={(e) => setName(e.target.value)}
          className="w-full border rounded p-2"
        />
        <input
          required
          type="tel"
          placeholder="رقم الهاتف"
          value={phone}
          onChange={(e) => setPhone(e.target.value)}
          className="w-full border rounded p-2"
        />
   <select
        required
        value={wilaya}
        onChange={(e) => {
          setWilaya(e.target.value);
          // إعادة ضبط البلدية لأول وحدة عند تغيير الولاية
          const newWilaya = wilayas.find((w) => w.name === e.target.value);
          setCommune(newWilaya?.communes[0] ?? "");
        }}
        className="w-full border rounded p-2 mb-4"
      >
        {wilayas.map((w) => (
          <option key={w.name} value={w.name}>
            {w.name}
          </option>
        ))}
      </select>

      {/* اختيار البلدية */}
      <label className="block mb-2">البلدية:</label>
      <select
        required
        value={commune}
        onChange={(e) => setCommune(e.target.value)}
        className="w-full border rounded p-2 mb-4"
      >
        {selectedWilaya?.communes.map((c) => (
          <option key={c} value={c}>
            {c}
          </option>
        ))}
      </select>
        <input
          required
          type="text"
          placeholder="العنوان الكامل"
          value={address}
          onChange={(e) => setAddress(e.target.value)}
          className="w-full border rounded p-2"
        />
        <select
          required
          value={delivery}
          onChange={(e) => setDelivery(e.target.value)}
          className="w-full border rounded p-2"
        >
          <option value="home">توصيل للمنزل</option>
          <option value="desk">التوصيل للمكتب</option>
        </select>
      </div>

      {/* عداد الكمية */}
      <div className="flex items-center gap-3 mt-4">
        <button
          onClick={() => setQuantity(quantity > 1 ? quantity - 1 : 1)}
          className="px-3 py-1 bg-gray-200 rounded"
        >
          -
        </button>
        <span>{quantity}</span>
        <button
          onClick={() => setQuantity(quantity + 1)}
          className="px-3 py-1 bg-gray-200 rounded"
        >
          +
        </button>
      </div>

      {/* السعر الإجمالي */}
       <div className="mt-6 p-4 border rounded bg-gray-50">
        <p>💰 المجموع: {total} دج</p>
        <p>🚚 مصاريف التوصيل: {deliveryPrice} دج</p>
        <hr className="my-2" />
        <p className="font-bold">
          ✅ المجموع الكلي مع التوصيل: {total + deliveryPrice} دج
        </p>
      </div>

      {/* زر الإرسال */}
      <button
        onClick={handleOrder}
        disabled={loading}
        className={`mt-6 w-full py-2 rounded ${
          loading ? "bg-gray-400 cursor-not-allowed" : "bg-black text-white"
        }`}
      >
        {loading ? "⏳ جاري الإرسال..." : "⬅️ تأكيد الطلب"}
      </button>
    </div>
  );
}
